Task1_h1
Да се напише метод на Java, който намира броят на всички цели, неотрицателни числа в даден интервал [bottom, top], които при преместване на първата им цифра най-отзад, се увеличават с повече от дадено число difference. Пример: Интервалът [bottom, top] е [1000, 1200] difference = 700; Примерно число, което отговаря на условието е: 1189, при преместване на първата му цифра най-отзад се получава 1891. Разликата между 1891 и 1189 е 702 > 700 (difference).
Input Format
1000
1200
700
Constraints
Границите на интервала bottom и top, трябва да бъдат неотрицателни числа. Ако не са въведени правилно, резултатът от изпълнението на метода, трябва да е 0;
Output Format
12

Task2_h1
Да се напише метод на Java, който връща сумата от числата в последователността, показана по-долу. Последователността от числа се определя от даден размер, който е цяло число в интервала [1,9].

Размер 2:

1221
 22
1221
Сума: 16

Размер 4:

12344321
 234432
  3443
   44
  3443
 234432
12344321
Сума: 112

Размер 6:

123456654321
 2345665432
  34566543
   456654
    5665
     66
    5665
   456654
  34566543
 2345665432
123456654321
Сума: 352

Input Format

6

Constraints

Размерът (size) e цяло число в интервала [1,9]. Ако размерът не е въведен правилно, методът трябва да връща 0.

Output Format

352

